feat: v0.8.10 hotfix release
